/*
	Написать программу, которая выводит в консоль список
логических дисков, которые доступны в данный момент.
	При разработке программы необходимо воспользоваться
функцией API:
	DWORD WINAPI GetLogicalDrives();
	Функция GetLogicalDrives возвращает битовую маску
логических дисков, которые доступны в данный момент. При
этом каждый бит маски представляет собой конкретный диск.
Если бит установлен, то логический диск доступен, в противном
случае бит будет сброшен. Бит 0 соответствует диску A, бит 1 –
диску B, бит 2 – диску С и т.д.
*/

#include <iostream>

int main()
{

}